#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`failure`

<details><summary>Show Plan</summary>

```terraform
terraform
module.eks.module.irsa_ebs_csi.data.aws_caller_identity.current: Reading...
module.vpc.data.aws_availability_zones.available: Reading...
module.jenkins.data.aws_ami.amazon_linux_2023_arm: Reading...
module.eks.module.aws_eks.data.aws_iam_policy_document.assume_role_policy[0]: Reading...
module.eks.module.aws_eks.module.kms.data.aws_caller_identity.current[0]: Reading...
module.jenkins.data.aws_availability_zones.available: Reading...
module.eks.module.irsa_ebs_csi.data.aws_partition.current: Reading...
module.eks.module.aws_eks.module.kms.data.aws_partition.current[0]: Reading...
module.eks.module.aws_eks.data.aws_caller_identity.current[0]: Reading...
aws_s3_bucket.state: Refreshing state... [id=cloud-infra-terraform-state-bucket]
module.eks.module.aws_eks.data.aws_iam_policy_document.assume_role_policy[0]: Read complete after 0s [id=2830595799]
module.eks.module.irsa_ebs_csi.data.aws_partition.current: Read complete after 0s [id=aws]
module.eks.module.aws_eks.module.kms.data.aws_partition.current[0]: Read complete after 0s [id=aws]
module.jenkins.aws_key_pair.jenkins: Refreshing state... [id=jenkins-key]
module.eks.module.aws_eks.module.eks_managed_node_group["default"].data.aws_iam_policy_document.assume_role_policy[0]: Reading...
module.eks.module.aws_eks.module.eks_managed_node_group["default"].data.aws_iam_policy_document.assume_role_policy[0]: Read complete after 0s [id=2560088296]
module.vpc.module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-02176cc2b17f10ac5]
module.eks.module.aws_eks.data.aws_partition.current[0]: Reading...
module.eks.module.aws_eks.data.aws_partition.current[0]: Read complete after 0s [id=aws]
module.eks.module.aws_eks.aws_iam_role.this[0]: Refreshing state... [id=app-cluster-cluster-20251108044658642100000001]
module.eks.module.irsa_ebs_csi.data.aws_caller_identity.current: Read complete after 0s [id=339051025574]
module.eks.module.aws_eks.module.eks_managed_node_group["default"].aws_iam_role.this[0]: Refreshing state... [id=default-eks-node-group-20251108041546755300000004]
module.eks.module.aws_eks.data.aws_caller_identity.current[0]: Read complete after 1s [id=339051025574]
module.eks.module.aws_eks.data.aws_iam_session_context.current[0]: Reading...
module.eks.module.aws_eks.aws_iam_role_policy_attachment.this["AmazonEKSClusterPolicy"]: Refreshing state... [id=app-cluster-cluster-20251108044658642100000001/arn:aws:iam::aws:policy/AmazonEKSClusterPolicy]
module.eks.module.aws_eks.data.aws_iam_session_context.current[0]: Read complete after 0s [id=arn:aws:sts::339051025574:assumed-role/GitHubActionsRole/github-actions-terraform-plan]
module.eks.module.aws_eks.module.eks_managed_node_group["default"].aws_iam_role_policy_attachment.this["AmazonEKS_CNI_Policy"]: Refreshing state... [id=default-eks-node-group-20251108041546755300000004/arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy]
module.eks.module.aws_eks.module.eks_managed_node_group["default"].aws_iam_role_policy_attachment.this["AmazonEKSWorkerNodePolicy"]: Refreshing state... [id=default-eks-node-group-20251108041546755300000004/arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy]
module.eks.module.aws_eks.module.eks_managed_node_group["default"].aws_iam_role_policy_attachment.this["AmazonEC2ContainerRegistryReadOnly"]: Refreshing state... [id=default-eks-node-group-20251108041546755300000004/arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly]
module.eks.module.aws_eks.module.kms.data.aws_caller_identity.current[0]: Read complete after 1s [id=339051025574]
module.eks.module.aws_eks.module.kms.data.aws_iam_policy_document.this[0]: Reading...
module.eks.module.aws_eks.module.kms.data.aws_iam_policy_document.this[0]: Read complete after 0s [id=4261354457]
module.eks.module.aws_eks.module.kms.aws_kms_key.this[0]: Refreshing state... [id=86602ea6-5bff-41fe-8a00-bfb1a344c506]
module.jenkins.data.aws_availability_zones.available: Read complete after 1s [id=eu-central-1]
module.vpc.data.aws_availability_zones.available: Read complete after 1s [id=eu-central-1]
module.jenkins.aws_ebs_volume.jenkins_data: Refreshing state... [id=vol-0e93e319afed0dfb4]
module.jenkins.data.aws_ami.amazon_linux_2023_arm: Read complete after 1s [id=ami-04b3ea741d7536e79]
module.eks.module.aws_eks.module.kms.aws_kms_alias.this["cluster"]: Refreshing state... [id=alias/eks/app-cluster]
module.eks.module.aws_eks.aws_iam_policy.cluster_encryption[0]: Refreshing state... [id=arn:aws:iam::339051025574:policy/app-cluster-cluster-ClusterEncryption20251108041610567400000005]
module.eks.module.aws_eks.aws_iam_role_policy_attachment.cluster_encryption[0]: Refreshing state... [id=app-cluster-cluster-20251108044658642100000001/arn:aws:iam::339051025574:policy/app-cluster-cluster-ClusterEncryption20251108041610567400000005]
module.vpc.module.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-06b610272e2b34b4e]
module.eks.module.aws_eks.aws_security_group.cluster[0]: Refreshing state... [id=sg-0de9d1e5c84c7e9f4]
module.vpc.module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-0c9c9cfeb60422ac0]
module.vpc.module.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-0499d32a8a226e86e]
module.vpc.module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-082172c48cbc5ab4f]
module.vpc.module.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-0d2c50d4f02ce26e0]
module.vpc.module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-0787e134f4aa8d918]
module.vpc.module.vpc.aws_route_table.private[1]: Refreshing state... [id=rtb-022b77f673c445d3f]
module.vpc.module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-0c067046be802feb1]
module.vpc.module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-037de9d5c17ca3808]
module.vpc.module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-0a43c693759d3cf49]
module.vpc.module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-0d4c8014d9bc83a50]
module.jenkins.aws_security_group.jenkins_sg: Refreshing state... [id=sg-0331187cc7f84949e]
module.eks.module.aws_eks.aws_security_group.node[0]: Refreshing state... [id=sg-057ae329f1379ed93]
module.vpc.module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-0994ec98753d4e0c8]
module.vpc.module.vpc.aws_eip.nat[1]: Refreshing state... [id=eipalloc-09782fe43aeb61090]
module.vpc.module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0eb25619823d1aa49]
module.vpc.module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-090360aa4ce73813e]
module.vpc.module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-0a43c693759d3cf491080289494]
module.jenkins.aws_instance.jenkins: Refreshing state... [id=i-0c923a8ad5fdc8b5c]
module.vpc.module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-082306372813bdc6b]
module.vpc.module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-073eedd1fefb3384b]
module.vpc.data.aws_subnet.private["subnet-037de9d5c17ca3808"]: Reading...
module.vpc.data.aws_subnet.private["subnet-0d4c8014d9bc83a50"]: Reading...
module.eks.module.aws_eks.aws_security_group_rule.node["ingress_self_coredns_udp"]: Refreshing state... [id=sgrule-768694080]
module.eks.module.aws_eks.aws_security_group_rule.node["ingress_cluster_10251_webhook"]: Refreshing state... [id=sgrule-1892223513]
module.eks.module.aws_eks.aws_security_group_rule.node["ingress_cluster_6443_webhook"]: Refreshing state... [id=sgrule-639468560]
module.vpc.data.aws_subnet.private["subnet-037de9d5c17ca3808"]: Read complete after 0s [id=subnet-037de9d5c17ca3808]
module.eks.module.aws_eks.aws_security_group_rule.node["ingress_cluster_443"]: Refreshing state... [id=sgrule-4244873371]
module.eks.module.aws_eks.aws_security_group_rule.node["ingress_self_coredns_tcp"]: Refreshing state... [id=sgrule-2307847343]
module.eks.module.aws_eks.aws_security_group_rule.node["ingress_cluster_kubelet"]: Refreshing state... [id=sgrule-1149262434]
module.eks.module.aws_eks.aws_security_group_rule.node["ingress_cluster_4443_webhook"]: Refreshing state... [id=sgrule-4016038790]
module.eks.module.aws_eks.aws_security_group_rule.node["ingress_cluster_8443_webhook"]: Refreshing state... [id=sgrule-893499441]
module.vpc.data.aws_subnet.private["subnet-0d4c8014d9bc83a50"]: Read complete after 0s [id=subnet-0d4c8014d9bc83a50]
module.eks.module.aws_eks.aws_security_group_rule.node["egress_all"]: Refreshing state... [id=sgrule-1794056299]
module.eks.module.aws_eks.aws_security_group_rule.node["ingress_nodes_ephemeral"]: Refreshing state... [id=sgrule-2995270535]
module.eks.module.aws_eks.aws_security_group_rule.node["ingress_cluster_9443_webhook"]: Refreshing state... [id=sgrule-1373670394]
module.eks.module.aws_eks.aws_security_group_rule.cluster["ingress_nodes_443"]: Refreshing state... [id=sgrule-3630466579]
module.vpc.module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-041557b84bbde764b]
module.vpc.module.vpc.aws_nat_gateway.this[1]: Refreshing state... [id=nat-0d4a6795edb688037]
module.vpc.module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-0787e134f4aa8d9181080289494]
module.vpc.module.vpc.aws_route.private_nat_gateway[1]: Refreshing state... [id=r-rtb-022b77f673c445d3f1080289494]
module.eks.module.aws_eks.aws_eks_cluster.this[0]: Refreshing state... [id=app-cluster]
module.eks.module.aws_eks.aws_ec2_tag.cluster_primary_security_group["Project"]: Refreshing state... [id=sg-0039c4eb1d463a8f6,Project]
module.eks.module.aws_eks.aws_ec2_tag.cluster_primary_security_group["ManagedBy"]: Refreshing state... [id=sg-0039c4eb1d463a8f6,ManagedBy]
module.eks.module.aws_eks.aws_ec2_tag.cluster_primary_security_group["Environment"]: Refreshing state... [id=sg-0039c4eb1d463a8f6,Environment]
module.eks.module.aws_eks.time_sleep.this[0]: Refreshing state... [id=2025-11-08T04:58:28Z]
module.eks.module.aws_eks.data.tls_certificate.this[0]: Reading...
module.eks.module.aws_eks.aws_eks_access_entry.this["cluster_creator"]: Refreshing state... [id=app-cluster:arn:aws:iam::339051025574:user/awscli]
module.eks.module.irsa_ebs_csi.data.aws_iam_policy_document.assume_role_with_oidc[0]: Reading...
module.eks.module.aws_eks.aws_eks_access_entry.this["github_actions"]: Refreshing state... [id=app-cluster:arn:aws:iam::339051025574:role/GitHubActionsRole]
module.eks.module.irsa_ebs_csi.data.aws_iam_policy_document.assume_role_with_oidc[0]: Read complete after 0s [id=106760243]
module.eks.module.irsa_ebs_csi.aws_iam_role.this[0]: Refreshing state... [id=app-cluster-ebs-csi]
module.eks.module.aws_eks.module.eks_managed_node_group["default"].module.user_data.null_resource.validate_cluster_service_cidr: Refreshing state... [id=4331594965444609131]
module.eks.module.aws_eks.module.eks_managed_node_group["default"].data.aws_ssm_parameter.ami[0]: Reading...
module.eks.module.aws_eks.module.eks_managed_node_group["default"].aws_launch_template.this[0]: Refreshing state... [id=lt-018ddef25993f9bec]
module.eks.module.irsa_ebs_csi.aws_iam_role_policy_attachment.custom[0]: Refreshing state... [id=app-cluster-ebs-csi/arn:aws:iam::aws:policy/service-role/AmazonEBSCSIDriverPolicy]
module.eks.module.aws_eks.data.aws_eks_addon_version.this["aws-ebs-csi-driver"]: Reading...
module.eks.module.aws_eks.data.aws_eks_addon_version.this["eks-pod-identity-agent"]: Reading...
module.eks.module.aws_eks.data.aws_eks_addon_version.this["vpc-cni"]: Reading...
module.eks.module.aws_eks.data.aws_eks_addon_version.this["kube-proxy"]: Reading...
module.eks.module.aws_eks.data.aws_eks_addon_version.this["coredns"]: Reading...
module.eks.module.aws_eks.aws_eks_access_policy_association.this["cluster_creator_admin"]: Refreshing state... [id=app-cluster#arn:aws:iam::339051025574:user/awscli#arn:aws:eks::aws:cluster-access-policy/AmazonEKSClusterAdminPolicy]
module.eks.module.aws_eks.data.tls_certificate.this[0]: Read complete after 0s [id=efc5619605e4300447be4c860675ff76c35033c7]
module.eks.module.aws_eks.aws_iam_openid_connect_provider.oidc_provider[0]: Refreshing state... [id=arn:aws:iam::339051025574:oidc-provider/oidc.eks.eu-central-1.amazonaws.com/id/0C5DFF69951658A589C810D1D6965A36]
module.eks.module.aws_eks.data.aws_eks_addon_version.this["aws-ebs-csi-driver"]: Read complete after 0s [id=aws-ebs-csi-driver]
module.eks.module.aws_eks.data.aws_eks_addon_version.this["eks-pod-identity-agent"]: Read complete after 0s [id=eks-pod-identity-agent]
module.eks.module.aws_eks.module.eks_managed_node_group["default"].data.aws_ssm_parameter.ami[0]: Read complete after 0s [id=/aws/service/eks/optimized-ami/1.33/amazon-linux-2023/arm64/standard/recommended/release_version]
module.eks.module.aws_eks.module.eks_managed_node_group["default"].aws_eks_node_group.this[0]: Refreshing state... [id=app-cluster:default-20251108045834338200000006]
module.eks.module.aws_eks.data.aws_eks_addon_version.this["vpc-cni"]: Read complete after 0s [id=vpc-cni]
module.eks.module.aws_eks.data.aws_eks_addon_version.this["kube-proxy"]: Read complete after 0s [id=kube-proxy]
module.eks.module.aws_eks.data.aws_eks_addon_version.this["coredns"]: Read complete after 0s [id=coredns]
module.eks.module.aws_eks.aws_eks_addon.before_compute["eks-pod-identity-agent"]: Refreshing state... [id=app-cluster:eks-pod-identity-agent]
module.eks.module.aws_eks.aws_eks_addon.before_compute["vpc-cni"]: Refreshing state... [id=app-cluster:vpc-cni]
module.eks.module.aws_eks.aws_eks_addon.this["kube-proxy"]: Refreshing state... [id=app-cluster:kube-proxy]
module.eks.module.aws_eks.aws_eks_addon.this["aws-ebs-csi-driver"]: Refreshing state... [id=app-cluster:aws-ebs-csi-driver]
module.eks.module.aws_eks.aws_eks_addon.this["coredns"]: Refreshing state... [id=app-cluster:coredns]
module.k8s.kubernetes_storage_class.ebs_gp3: Refreshing state... [id=ebs-gp3]
module.k8s.kubernetes_storage_class.ebs_gp3_default: Refreshing state... [id=ebs-gp3-default]
module.argocd.helm_release.argocd: Refreshing state... [id=argocd]
module.jenkins.aws_volume_attachment.jenkins_data: Refreshing state... [id=vai-714043021]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform planned the following actions, but then encountered a problem:

  # module.eks.module.aws_eks.aws_eks_access_entry.this["cluster_creator"] must be replaced
-/+ resource "aws_eks_access_entry" "this" {
      ~ access_entry_arn  = "arn:aws:eks:eu-central-1:339051025574:access-entry/app-cluster/user/339051025574/awscli/02cd30ea-06ba-276d-6d32-a693605d2161" -> (known after apply)
      ~ created_at        = "2025-11-08T04:57:58Z" -> (known after apply)
      ~ id                = "app-cluster:arn:aws:iam::339051025574:user/awscli" -> (known after apply)
      ~ kubernetes_groups = [] -> (known after apply)
      ~ modified_at       = "2025-11-08T04:57:58Z" -> (known after apply)
      ~ principal_arn     = "arn:aws:iam::339051025574:user/awscli" -> "arn:aws:iam::339051025574:role/GitHubActionsRole" # forces replacement
        tags              = {
            "Environment" = "production"
            "ManagedBy"   = "terraform"
            "Project"     = "cloud-infra"
        }
      ~ user_name         = "arn:aws:iam::339051025574:user/awscli" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.eks.module.aws_eks.aws_eks_access_policy_association.this["cluster_creator_admin"] must be replaced
-/+ resource "aws_eks_access_policy_association" "this" {
      ~ associated_at = "2025-11-08 04:57:59.231 +0000 UTC" -> (known after apply)
      ~ id            = "app-cluster#arn:aws:iam::339051025574:user/awscli#arn:aws:eks::aws:cluster-access-policy/AmazonEKSClusterAdminPolicy" -> (known after apply)
      ~ modified_at   = "2025-11-08 04:57:59.231 +0000 UTC" -> (known after apply)
      ~ principal_arn = "arn:aws:iam::339051025574:user/awscli" -> "arn:aws:iam::339051025574:role/GitHubActionsRole" # forces replacement
        # (3 unchanged attributes hidden)

      ~ access_scope {
          - namespaces = [] -> null
            # (1 unchanged attribute hidden)
        }
    }

  # module.eks.module.aws_eks.module.kms.aws_kms_key.this[0] will be updated in-place
  ~ resource "aws_kms_key" "this" {
        id                                 = "86602ea6-5bff-41fe-8a00-bfb1a344c506"
      ~ policy                             = jsonencode(
          ~ {
              ~ Statement = [
                    {
                        Action    = "kms:*"
                        Effect    = "Allow"
                        Principal = {
                            AWS = "arn:aws:iam::339051025574:root"
                        }
                        Resource  = "*"
                        Sid       = "Default"
                    },
                  ~ {
                      ~ Principal = {
                          ~ AWS = "arn:aws:iam::339051025574:user/awscli" -> "arn:aws:iam::339051025574:role/GitHubActionsRole"
                        }
                        # (4 unchanged attributes hidden)
                    },
                    {
                        Action    = [
                            "kms:ReEncrypt*",
                            "kms:GenerateDataKey*",
                            "kms:Encrypt",
                            "kms:DescribeKey",
                            "kms:Decrypt",
                        ]
                        Effect    = "Allow"
                        Principal = {
                            AWS = "arn:aws:iam::339051025574:role/app-cluster-cluster-20251108044658642100000001"
                        }
                        Resource  = "*"
                        Sid       = "KeyUsage"
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        tags                               = {
            "Environment"           = "production"
            "ManagedBy"             = "terraform"
            "Project"               = "cloud-infra"
            "terraform-aws-modules" = "eks"
        }
        # (14 unchanged attributes hidden)
    }

Plan: 2 to add, 1 to change, 2 to destroy.
Releasing state lock. This may take a few moments...

```

</details>

*Pusher: @Artyom-K-Dev, Action: `pull_request`*